# LAB | Connecting Python to SQL

In this lab, the objective is to identify the customers who were active in both May and June, and how did their activity differ between months. To achieve this, follow these steps:

Establish a connection between Python and the Sakila database.

Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
month: an integer representing the month for which rental data is to be retrieved.
year: an integer representing the year for which rental data is to be retrieved.
The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

Hint: Consider making use of pandas groupby()

Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

In [2]:
import getpass

In [3]:
password = getpass.getpass()

 ········

In [4]:
#Establish a connection between Python and the Sakila database.

connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [5]:
data = pd.read_sql_query('SELECT * FROM customer', engine)
data.head()

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1,2006-02-14 22:04:36,2006-02-15 04:57:20
3,4,2,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,8,1,2006-02-14 22:04:36,2006-02-15 04:57:20
4,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [34]:
#Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

#engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
#month: an integer representing the month for which rental data is to be retrieved.
#year: an integer representing the year for which rental data is to be retrieved.
#The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

def rentals_month(engine, month, year):
    
    query = f"""
        SELECT *
        FROM rental
        WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year}"""

    rental_data = pd.read_sql_query(query, engine)

    return rental_data

##TEST/EXAMPLE

rental_data = rentals_month(engine, month=5, year=2005)

display(rental_data.head())

type(rental_data)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

pandas.core.frame.DataFrame

In [33]:
#Develop a Python function called rental_count_month that takes the DataFrame 
#provided by rentals_month as input along with the month and year and returns a new DataFrame 
#containing the number of rentals made by each customer_id during the selected month and year.

#The function should also include the month and year as parameters and use them to name 
#the new column according to the month and year, for example, if the input month is 05 and the year is 2005, 
#the column name should be "rentals_05_2005".

#Hint: Consider making use of pandas groupby()


def rental_count_month(df: pd.DataFrame, month, year):
    
    rentals = rentals_month(engine, month, year)
    
    rental_count_customer = rentals.groupby('customer_id').size().reset_index(name=f'rentals_{month}_{year}')

    return rental_count_customer


##TEST/EXAMPLE

rental_counts_data = rental_count_month(rental_data, month=5, year=2005)
display(rental_counts_data.head())

type(rental_counts_data)

   customer_id  rentals_5_2005
0            1               2
1            2               1
2            3               2
3            5               3
4            6               3

pandas.core.frame.DataFrame

In [37]:
##another test

rental_counts_data2 = rental_count_month(rental_data, month=7, year=2005)
display(rental_counts_data2.head())

   customer_id  rentals_7_2005
0            1              12
1            2              14
2            3              13
3            4               5
4            5              16

In [12]:
#Create a Python function called compare_rentals that takes two DataFrames as input 
#containing the number of rentals made by each customer in different months and years. 
#The function should return a combined DataFrame with a new 'difference' column, 
#which is the difference between the number of rentals in the two months.

def compare_rentals(df1: pd.DataFrame, df2: pd.DataFrame, month1, year1, month2, year2):

    rental_counts1 = rental_count_month(df1, month1, year1)
    rental_counts2 = rental_count_month(df2, month2, year2)

    merged_df = pd.merge(rental_counts1, rental_counts2, on='customer_id', how='outer', suffixes=('_month1', '_month2'))

    merged_df = merged_df.fillna(0)

    merged_df['difference'] = merged_df[f'rentals_{month2}_{year2}'] - merged_df[f'rentals_{month1}_{year1}']

    return merged_df

In [35]:
compare_rentals_df = compare_rentals(rental_data, rental_data, month1=2, month2=5, year1=2006, year2=2005)

compare_rentals_df

     customer_id  rentals_2_2006  rentals_5_2005  difference
0              5             1.0             3.0         2.0
1              9             1.0             3.0         2.0
2             11             1.0             1.0         0.0
3             14             1.0             5.0         4.0
4             15             2.0             0.0        -2.0
..           ...             ...             ...         ...
534          589             0.0             3.0         3.0
535          593             0.0             2.0         2.0
536          594             0.0             4.0         4.0
537          595             0.0             1.0         1.0
538          599             0.0             1.0         1.0

[539 rows x 4 columns]